# CC_GetEquipmentItem

## Description
Gets the associated equipment item from the given device handle.

```pascal
FUNCTION CC_GetEquipmentItem(hDevice : HANDLE): HANDLE;
```

```python
def vs.CC_GetEquipmentItem(hDevice):
    return HANDLE
```

## Parameters
|Name|Type|Description|
|---|---|---|
|hDevice|HANDLE|   |

## Version
Availability: from Vectorworks 2025

## Category
* ConnectCAD